[
  { "id": "1", "title": "A Smarter Way to Learn JavaScript: The new tech-assisted approach that requires half the effort", "description": "According to Mark Myers, the author of the A Smarter Way to Learn JavaScript, there are two important problems faced by those willing to learn JavaScript. These are retention and comprehension. As such, the JS book is written while especially addressing the two issues. It is the best book to learn javascript.", "price": 10 },
  { "id": "2", "title": "Eloquent JavaScript: A Modern Introduction to Programming", "description": "Probably the biggest standout of Eloquent JavaScript: A Modern Introduction to Programming is its heavy usage of practice exercises. Unlike other books on programming and JS, this book is a work of pure art.", "price": 20 },
  { "id": "3", "title": "JavaScript & JQuery: Interactive Front-End Web Development", "description": "Interested in learning JavaScript & jQuery side-by-side for getting started with web development? JavaScript and JQuery: Interactive Front-End Web Development is the top recommendation.", "price": 30 },
  { "id": "4", "title": "JavaScript: The Good Parts", "description": "With the JavaScript: The Good Parts, author Douglas Crockford focuses on the basics of some of the lesser-known yet desirable aspects of JavaScript. It’s only recently that these hidden features are getting the appreciation they deserve from the programming community.", "price": 40 },
  { "id": "5", "title": "Learn JavaScript VISUALLY", "description": "For newbies wishing to quickly grasp the basics of JavaScript, Learn JavaScript VISUALLY the ideal book to go for. The book makes understanding the basic JS concepts easier by means of a visual approach, hence the name.", "price": 50 },
  { "id": "6", "title": "JavaScript: The Definitive Guide", "description": "Another beginner-friendly JavaScript book is the JavaScript: The Definitive Guide. Anyone interested in building powerful web applications must go through the comprehensive JS book. It explores several JS and web platform API features aimed at web application development.", "price": 60 },
  { "id": "7", "title": "Effective JavaScript: 68 Specific Ways to Harness the Power of JavaScript", "description": "Anyone who has an ample understanding of the JS basics qualifies to gain the most out of Effective JavaScript: 68 Specific Ways to Harness the Power of JavaScript. The JavaScript book takes its readers on an in-depth tour of the high-level, interpreted programming language.", "price": 70 },
  { "id": "8", "title": "JavaScript for Kids: A Playful Introduction to Programming", "description": "The name of the book kind of puns on those that are new to the world of programming. JavaScript for Kids: A Playful Introduction to Programming offers a fanciful exploration of the various basic programming concepts.", "price": 80 },
  { "id": "9", "title": "Programming JavaScript Applications: Robust Web Architecture with Node, HTML5, and Moderns JS Libraries", "description": "Unlike other JS books that answer the question, “How do I use JavaScript?” Programming JavaScript Applications: Robust Web Architecture with Node, HTML5, and Modern JS Libraries answers, “How do I use JavaScript to build a real-world application?”", "price": 90 },
  { "id": "10", "title": "High-Performance Browser Networking", "description": "Application performance is something that everyone, ranging from independent developers to full-fledged organizations, crave for. High-Performance Browser Networking is the ultimate guide for building a successful JavaScript application with highly optimized performance.", "price": 100 }
]
